[ { "key"       : "led2012-sky-phenomena",
    "bibtex"    : "bib/led2012-sky-phenomena.bib",
    "title"     : "Single-Pass Rendering of Day and Night Sky Phenomena",
    "date"      : "2012-11-01",
    "authors"   : [ "Daniel Limberger", "Juri Engel", "Jürgen Döllner" ],
    "published" : "In Proceedings of the Vision, Modeling, and Visualization Workshop",
    "caption"   : "This paper presents astronomical based rendering of skies as seen from low altitudes on earth, in respect to location, date, and time. The technique allows to compose an atmosphere with sun, multiple cloud layers, moon, bright stars, and Milky Way, into a holistic sky with unprecedented high level of detail and diversity. GPU generated, viewpoint-aligned billboards are used to render stars with approximated color, brightness, and scintillations. A similar approach is used to synthesize the moon considering lunar phase, earthshine, shading, and lunar eclipses. Atmosphere and clouds are rendered using existing methods adapted to our needs. Rendering is done in a single pass supporting interactive ...",
    "thumbnail" : "/img/2012-vmv-day-and-night-sky.jpg",
    "flickr"    : "72157650186586300",
    "downloads" : [
      { "href"  : "http://dx.doi.org/10.2312/PE/VMV/VMV12/055-062",
        "desc"  : "DOI"
      },
      { "href"  : "https://drive.google.com/file/d/0B9sUajZRijJAMi1maGtNOV9GTU0/view",
        "desc"  : "Paper (PDF, 5.7 MiB)"
      },
      { "href"  : "https://drive.google.com/file/d/0B9sUajZRijJAeEg2NGtKV3NLWk0/view",
        "desc"  : "Slides (PDF, 3.0 MiB)"
      },
      { "href"  : "https://www.youtube.com/watch?v=t8ibsEl0kAI",
        "desc"  : "Video (YouTube)",
        "popup" : "youtube"
      },
      { "href"  : "https://code.google.com/p/osghimmel/",
        "desc"  : "Google Code"
      } ],
    },

    { "key"       : "lwtd2013-web-based-swmaps",
      "bibtex"    : "bib/lwtd2013-web-based-swmaps.bib",
      "title"     : "Interactive Software Maps for Web-Based Source Code Analysis",
      "date"      : "2013-05-01",
      "authors"   : [ "Daniel Limberger", "Benjamin Wasty", "Jonas Trümper", "Jürgen Döllner" ],
      "published" : "In Proceedings of the International Web3D Conference",
      "caption"   : "Software maps -- linking rectangular 3D-Treemaps, software system structure, and performance indicators -- are commonly used to support informed decision making in software-engineering processes. We present a web-based rendering system for software maps that achieves both fast client-side page load time and interactive frame rates even with large software maps. We significantly reduce page load time by efficiently encoding hierarchy and geometry data for the net transport. Apart from that, appropriate interaction, layouting, and labeling techniques as well as common image enhancements aid evaluation of project-related quality aspects.",
      "thumbnail" : "/img/2013-web3d-interactive-software-maps.jpg",
      "flickr"    : "72157650179270797",
      "downloads"   : [
      { "href"    : "http://doi.acm.org/10.1145/2466533.2466550",
        "desc"    : "DOI"
      },
      { "href"    : "https://drive.google.com/file/d/0B9sUajZRijJAYTQwM3NlajlRZEE/view",
        "desc"    : "Paper (PDF, 3.0 MiB)"
      },
      { "href"    : "https://drive.google.com/file/d/0B9sUajZRijJAU2ZqbENPN3BFUXc/view",
        "desc"    : "Slides (PDF, 14.9 MiB)"
      },
      { "href"    : "https://www.youtube.com/watch?v=AaHJRVQ3Z1E",
        "desc"    : "Video (YouTube)",
        "video"   : "youtube"
      } ],
    },

    { "key"       : "ld2014-parameter-painting",
      "bibtex"    : "bib/ld2014-parameter-painting.bib",
      "title"     : "Painting Per-Pixel Parametrization for Interactive Image Filtering",
      "date"      : "2014-08-01",
      "authors"   : [ "Daniel Limberger", "Jürgen Döllner" ],
      "published" : "In Expressive Poster Session",
      "caption"   : "We present a photo-editing method that enables per-pixel parameter manipulation of image filtering by means of interactive painting. Predefined as well as custom image filters are exposed to the user, as a parametrizable composition of image operations. Brushes, as a sequences of actions mapping user inputs (in terms of brush shape, flow, pressure, etc.) to arbitrary functions or convolution operators, are used to draw within the parameter space. Our tool demonstrates that interactive painting can be used to, e.g., locally tweak inadequate parametrization and, furthermore, provides a blueprint for an open, collaborative photo-editing platform.",
      "thumbnail" : "/img/2014-expressive-painting-per-pixel-parametrization.jpg",
      "flickr"    : "72157650124474077",
      "downloads" : [
      { "href"    : "https://drive.google.com/file/d/0B9sUajZRijJAZm1GSHhKdHNvdjg/view",
        "desc"    : "Poster (PDF, 19.1 MiB)"
      } ],
  } ]
